/*
 PFAssistiveErrors.strings
 PFAssistive Framework 3.0.0
 Copyright 2003-2010 Bill Cheeseman. Used by permission.
 All rights reserved.
*/

/* kAXErrorFailure -25200 */
"Description for error -25200" = "because of an accessibility failure.";
"Failure reason for error -25200" = "A failure occurred";
"Recovery suggestion for error -25200" = "Click \"OK\" to continue.";

/* kAXErrorIllegalArgument -25201 */
"Description for error -25201" = "because of an illegal accessibility argument.";
"Failure reason for error -25201" = "Encountered an illegal argument";
"Recovery suggestion for error -25201" = "Click \"OK\" to continue.";

/* kAXErrorInvalidUIElement -25202 */
"Description for error -25202" = "because of an invalid accessibility UI element.";
"Failure reason for error -25202" = "Encountered an invalid UI element";
"Recovery suggestion for error -25202" = "Click \"OK\" to continue.";

/* kAXErrorInvalidUIElementObserver -25203 */
"Description for error -25203" = "because of an invalid accessibility UI element observer.";
"Failure reason for error -25203" = "Encountered an invalid UI element observer";
"Recovery suggestion for error -25203" = "Click \"OK\" to continue.";

/* kAXErrorCannotComplete -25204 */
"Description for error -25204" = "because an accessibility operation could not complete.";
"Failure reason for error -25204" = "Could not complete an operation";
"Recovery suggestion for error -25204" = "Click \"OK\" to continue.";

/* kAXErrorAttributeUnsupported -25205 */
"Description for error -25205" = "because of an unsupported accessibility attribute.";
"Failure reason for error -25205" = "Encountered an unsupported attribute";
"Recovery suggestion for error -25205" = "Click \"OK\" to continue.";

/* kAXErrorActionUnsupported -25206 */
"Description for error -25206" = "because of an unsupported accessibility action.";
"Failure reason for error -25206" = "Encountered an unsupported action";
"Recovery suggestion for error -25206" = "Click \"OK\" to continue.";

/* kAXErrorNotificationUnsupported -25207 */
"Description for error -25207" = "because of an unsupported accessibility notification.";
"Failure reason for error -25207" = "Encountered an unsupported notification";
"Recovery suggestion for error -25207" = "Click \"OK\" to continue.";

/* kAXErrorNotImplemented -25208 */
"Description for error -25208" = "because an accessibility feature is not implemented.";
"Failure reason for error -25208" = "Encountered a feature that is not implemented";
"Recovery suggestion for error -25208" = "Click \"OK\" to continue.";

/* kAXErrorNotificationAlreadyRegistered -25209 */
"Description for error -25209" = "because an accessibility notification was already registered.";
"Failure reason for error -25209" = "Encountered a notification that was already registered";
"Recovery suggestion for error -25209" = "Click \"OK\" to continue.";

/* kAXErrorNotificationNotRegistered -25210 */
"Description for error -25210" = "because an accessibility notification was not registered.";
"Failure reason for error -25210" = "Encountered a notification that was not registered";
"Recovery suggestion for error -25210" = "Click \"OK\" to continue.";

/* kAXErrorAPIDisabled -25211 */
"Description for error -25211" = "because access for assistive devices was not enabled.";
"Failure reason for error -25211" = "Access for assistive devices was not enabled";
"Recovery suggestion for error -25211" = "Enable access for assistive devices in the Universal Access pane of System Preferences, then click \"OK\" to continue.";

/* kAXErrorNoValue -25212 */
"Description for error -25212" = "because no accessibility value was available.";
"Failure reason for error -25212" = "No value was available";
"Recovery suggestion for error -25212" = "Click \"OK\" to continue.";

/* kAXErrorParameterizedAttributeUnsupported -25213 */
"Description for error -25213" = "because of an unsupported accessibility parameterized attribute.";
"Failure reason for error -25213" = "Encountered an unsupported parameterized attribute";
"Recovery suggestion for error -25213" = "Click \"OK\" to continue.";

/* kAXErrorNotEnoughPrecision -25214 */
"Description for error -25214" = "because of insufficient precision.";
"Failure reason for error -25214" = "Not enough precision";
"Recovery suggestion for error -25214" = "Click \"OK\" to continue.";

/* DETAILED REASONS */

/* Description prefix for +[PFUIElement elementAtPoint:withDelegate:error:] */
"Could not read the screen" = "Could not read the screen";

/* Failure reason suffix for +[PFUIElement elementAtPoint:withDelegate:error:] */
"while reading the screen at %@ for any application" = "while reading the screen at %@ for any application";

/* Description prefix for -[PFUIElement pid] */
"Could not get the application PID" = "Could not get the application PID";

/* Failure reason suffix for -[PFUIElement pid] */
"while getting the application Process Identification Number from an %@ element" = "while getting the application Process Identification Number from an %@ element";

/* Description prefix for -[PFUIElement setObject:forAttribute:] */
"Could not set a value for an attribute" = "Could not set a value for an attribute";

/* Failure reason suffix for -[PFUIElement setObject:forAttribute:] */
"while setting a value for the %@ attribute of an %@ element" = "while setting a value for the %@ attribute of an %@ element";

/* Description prefix for -[PFUIElement objectForAttribute:] */
"Could not get a value for an attribute" = "Could not get a value for an attribute";

/* Failure reason suffix for -[PFUIElement objectForAttribute:] */
"while getting a value for the %@ attribute of an %@ element" = "while getting a value for the %@ attribute of an %@ element";

/* Description prefix for -[PFUIElement objectsForAttributes:] */
"Could not get values for multiple attributes" = "Could not get values for multiple attributes";

/* Failure reason suffix for -[PFUIElement objectsForAttributes:] */
"while getting values for multiple attributes of an %@ element" = "while getting values for multiple attributes of an %@ element";

/* Description prefix for -[PFUIElement objectsForAttribute:range:] */
"Could not get a range of values for an attribute" = "Could not get a range of values for an attribute";

/* Failure reason suffix for -[PFUIElement objectsForAttribute:range:] */
"while getting a range of values for the %@ attribute of an %@ element" = "while getting a range of values for the %@ attribute of an %@ element";

/* Description prefix for -[PFUIElement objectForAttribute:parameter:] */
"Could not get a value for a parameterized attribute" = "Could not get a value for a parameterized attribute";

/* Failure reason suffix for -[PFUIElement objectForAttribute:parameter:] */
"while getting a value for the %@ attribute of an %@ element with parameter %@" = "while getting a value for the %@ attribute of an %@ element with parameter %@";

/* Description prefix for -[PFUIElement countForAttribute:] */
"Could not count the values for an attribute" = "Could not count the values for an attribute";

/* Failure reason suffix for -[PFUIElement countForAttribute:] */
"while counting the values for the %@ attribute of an %@ element" = "while counting the values for the %@ attribute of an %@ element";

/* Description prefix for -[PFUIElement isSettableAttribute:] */
"Could not determine whether an attribute can be modified" = "Could not determine whether an attribute can be modified";

/* Failure reason suffix for -[PFUIElement isSettableAttribute:] */
"while determining whether the %@ attribute of an %@ element can be modified" = "while determining whether the %@ attribute of an %@ element can be modified";

/* Description prefix for -[PFUIElement actions] */
"Could not get supported actions" = "Could not get supported actions";

/* Failure reason suffix for -[PFUIElement actions] */
"while getting the actions supported by an %@ element" = "while getting the actions supported by an %@ element";

/* Description prefix for -[PFUIElement descriptionForAction:] */
"Could not get the description of an action" = "Could not get the description of an action";

/* Failure reason suffix for -[PFUIElement descriptionForAction:] */
"while getting the description of the %@ action of an %@ element" = "while getting the description of the %@ action of an %@ element";

/* Description prefix for -[PFUIElement performAction:] */
"Could not perform an action" = "Could not perform an action";

/* Failure reason suffix for -[PFUIElement performAction:] */
"while performing the %@ action of an %@ element" = "while performing the %@ action of an %@ element";

/* Description prefix for -[PFUIElement elementAtPoint:] */
"Could not read the screen" = "Could not read the screen";

/* Failure reason suffix for -[PFUIElement elementAtPoint:] */
"while reading the screen at %@" = "while reading the screen at %@";